Autodesk.Revit.DB.Architecture.StairsConstructionMethod
Represents the construction method of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsConstructionMethod.Precast
The stairs is constructed by precast method.

Autodesk.Revit.DB.Architecture.StairsConstructionMethod.CastInPlace
The stairs is constructed by cast-in-place method.

Autodesk.Revit.DB.Architecture.StairsConstructionMethod.Assembled
The stairs is constructed by assembly method.